a=input('Введите на правление движения (влево/вправо/вверх/вниз):')
if a=='влево' or a=='вправо' or a=='вверх' or a=='вниз':
    b=float(input('Введите количество шагов:'))
    if a=='влево':
        x=-b
        y=0
        print(f'({x}:{y})')
    elif a=='вправо':
        x=b
        y=0
        print(f'({x}:{y})')
    elif a=='вверх':
        x=0
        y=b
        print(f'({x}:{y})')
    elif a=='вниз':
        x=0
        y=-b
        print(f'({x}:{y})')
else:
    print('Вы ввели неверное направление!')
